# NewPointOnEdge Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewPointOnEdge Method
Application Class See Also
---
Create a PointOnEdge object which is used to define the placement of a ReferencePoint.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PointOnEdge NewPointOnEdge(
	Reference edgeReference,
	PointLocationOnCurve locationOnCurve
)
```

Visual Basic
---
```text
Public Function NewPointOnEdge ( _
	edgeReference As Reference, _
	locationOnCurve As PointLocationOnCurve _
) As PointOnEdge
```

Visual C++
---
```text
public:
PointOnEdge^ NewPointOnEdge(
	Reference^ edgeReference,
	PointLocationOnCurve^ locationOnCurve
)
```

# ### Parameters
edgeReference
    Type: Autodesk.Revit.DB..::..ReferenceThe reference whose edge the object will be created on.
locationOnCurve
    Type: Autodesk.Revit.DB..::..PointLocationOnCurveThe location on the edge.
# ### Return Value
If creation was successful then a new object is returned, otherwise an exception with failure information will be thrown.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the input argument edgeReference or locationOnCurve is nullNothingnullptra null reference (Nothing in Visual Basic). |

# See Also
Application Class
Autodesk.Revit.Creation Namespace